app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('Ops', '2010-11-02 23:02:52', '2010-11-02 23:02:52')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "updated_at" = '2010-11-05 22:17:43', "name" = 'Features' WHERE "id" = 1

  def auto_create
    cat = Category.new(:name => params[:name])
    cat.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('Biz Dev', '2010-11-04 23:23:35', '2010-11-04 23:23:35')