app/controllers/chips_controller.rb

  def index
    @users = User.all
    @categories = Category.all
    @todays_chips = Chip.today
    @this_weeks_chips = Chip.last_month.group_by(&:category)
---
SELECT * FROM "users"
SELECT * FROM "categories"
SELECT * FROM "chips" WHERE (date(created_at) > date('2010-10-03 23:12:26') AND date(created_at) < date('2010-11-03'))

  def show
    @chip = Chip.find(params[:id])
---
SELECT * FROM "chips" WHERE ("chips"."id" = 0)

  def auto_create
    c = Chip.new(:user_id => params[:user], :category_id => params[:category])
    c.save
---
INSERT INTO "chips" ("created_at", "updated_at", "user_id", "category_id") VALUES('2010-11-03 00:04:48', '2010-11-03 00:04:48', 1, 1)

  def auto_destroy
    result = "fail"

    c = Chip.find(params[:chip])

    if c != nil
      c.destroy
---
SELECT * FROM "chips" WHERE ("chips"."id" = 71)
DELETE FROM "chips" WHERE "id" = 1