app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "last_request_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES(NULL, '2010-11-05 21:25:04', '2010-11-05 21:25:04', '9172b672f0659852c3c0ac04b49b0263467dd5863daddf71eff0ee767851f1f0373768aa6196299d0766dfdc2316ea99ed269ec065c14780e5d8ccf2851c7395', '2010-11-05 21:25:04', '127.0.0.1', 'O7uDrXSqWtoZAdx5XOV', '2010-11-05 21:25:03', '500641d54581707cc975c81070547dcf2bb005bff722fa20829d5cc7b6288a6657364e3e431585b55fcd5cc7b5ede962221070d58fdd7114d00e52b9a836ac82', 1, NULL, 'test', NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE "users" SET "login_count" = 6, "persistence_token" = '1781f31816844e755dc6747a58b99995fd36140c788e34fabfa6ca4b2d6d3dfdac527a1b5a24f0386c386c977ba1076d9576d5d9e1da152a32b3914507b21afc', "updated_at" = '2010-11-05 22:07:11', "last_request_at" = '2010-11-05 22:07:11', "last_login_at" = '2010-11-05 21:55:19', "current_login_at" = '2010-11-05 22:07:11', "password_salt" = 'Kju3d4BYLc7imsILaqs', "crypted_password" = 'f6667a71cdb69058575d409b3787acc126fc4ead23e8e0503bfe1f911df1f6cca7fb999a907a34d10cbb42993b664b53b845a94be006160a16f1a14ca9779477' WHERE "id" = 1
---
  def update
    @user = @current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])